//--------------------控制测试如何运行------------------------


/*******************************并行或连续的运行测试****************************/
pub fn hello_1() {
    println!("1");
}
pub fn hello_2() {
    println!("2");
}

//压强转换为重量
pub fn p_to_kg(p:f32) -> f32 {
    p*10.204
}
/******************************************snip******************************/



/****************************显式函数输出*******************/




#[cfg(test)]
mod tests {
    use super::*;

    #[test]
    fn it_work_1() {
        hello_1();
    }

    #[test]
    fn it_work_2() {
        hello_2();
    }

    #[test]
    fn p_to_kg_success() {
        let result = p_to_kg(0.45);
        assert_eq!(4.592,result,"得到的实际测试结果为{},与4.592kg不等。",result);
    }
}
